performance-test-results.txt
Server Software:        nginx/1.4.4
Server Hostname:        rubadi.bahmanm.com
Server Port:            80

Document Path:          /campaigns/1
Document Length:        59 bytes

Concurrency Level:      100
Time taken for tests:   47.536 seconds
Complete requests:      15000
Failed requests:        0
Write errors:           0
Total transferred:      4650000 bytes
HTML transferred:       885000 bytes
Requests per second:    315.55 [#/sec] (mean)
Time per request:       316.907 [ms] (mean)
Time per request:       3.169 [ms] (mean, across all concurrent requests)
Transfer rate:          95.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0      39
Processing:    54  316  98.9    308     789
Waiting:       54  316  98.7    308     789
Total:         54  316  98.9    308     789

Percentage of the requests served within a certain time (ms)
  50%    308
  66%    350
  75%    378
  80%    397
  90%    448
  95%    490
  98%    545
  99%    579
 100%    789 (longest request)