performance-test-results.txt
Server Software:        nginx/1.4.4
Server Hostname:        rubadi.bahmanm.com
Server Port:            80

Document Path:          /campaigns/1
Document Length:        59 bytes

Concurrency Level:      100
Time taken for tests:   41.233 seconds
Complete requests:      15000
Failed requests:        0
Write errors:           0
Total transferred:      4635000 bytes
HTML transferred:       885000 bytes
Requests per second:    363.79 [#/sec] (mean)
Time per request:       274.886 [ms] (mean)
Time per request:       2.749 [ms] (mean, across all concurrent requests)
Transfer rate:          109.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.4      0      31
Processing:    34  273  75.1    277     561
Waiting:       34  273  75.1    277     560
Total:         34  274  75.0    278     561

Percentage of the requests served within a certain time (ms)
  50%    278
  66%    301
  75%    322
  80%    334
  90%    370
  95%    398
  98%    432
  99%    460
 100%    561 (longest request)