performance-test-results.txt
Server Software:        nginx/1.4.4
Server Hostname:        rubadi.bahmanm.com
Server Port:            80

Document Path:          /campaigns/22
Document Length:        59 bytes

Concurrency Level:      100
Time taken for tests:   57.536 seconds
Complete requests:      8000
Failed requests:        0
Write errors:           0
Total transferred:      2480000 bytes
HTML transferred:       472000 bytes
Requests per second:    139.04 [#/sec] (mean)
Time per request:       719.197 [ms] (mean)
Time per request:       7.192 [ms] (mean, across all concurrent requests)
Transfer rate:          42.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0      10
Processing:   225  716 206.9    678    2167
Waiting:      224  716 206.9    677    2167
Total:        225  716 206.8    678    2168

Percentage of the requests served within a certain time (ms)
  50%    678
  66%    757
  75%    813
  80%    853
  90%    984
  95%   1113
  98%   1278
  99%   1386
 100%   2168 (longest request)